#+TITLE: migrate from doom to guix-home style emacs

** Daviwil

#+begin_src shell :eval no
git clone https://github.com/daviwil/dotfiles ./migrate/daviwil
cd ./migrate/daviwil
git checkout -b guix-home origin/guix-home
#+end_src

#+RESULTS:
: branch 'guix-home' set up to track 'origin/guix-home'.

*** For latex

#+begin_src shell :results output table
grep -e "tex" ./migrate/pkg/*-only.list \
    | sed -e "s/:/\t/"
#+end_src

#+RESULTS:
| ./migrate/pkg/daviwil-only.list | default-text-scale |
| ./migrate/pkg/doom-only.list    | auctex             |
| ./migrate/pkg/doom-only.list    | cdlatex            |
| ./migrate/pkg/doom-only.list    | company-auctex     |
| ./migrate/pkg/doom-only.list    | company-reftex     |
| ./migrate/pkg/doom-only.list    | helm-bibtex        |
| ./migrate/pkg/doom-only.list    | latex-preview-pane |

